package com.example.loveshayari.Activity;

import androidx.appcompat.app.AppCompatActivity;

import android.annotation.SuppressLint;
import android.content.Intent;
import android.os.Bundle;
import android.util.Log;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ListView;

//import com.example.loveshayari.Adapter.Category_List_Adapter;
import com.example.loveshayari.Adapter.Category_Adapter;
import com.example.loveshayari.Adapter.Category_List_Adapter;
import com.example.loveshayari.R;

public class List_activity extends AppCompatActivity {

    ListView listView;

    Category_List_Adapter adapter;

    String shubhkamna[] = {"ये इश्क भी एक अजीब एहसास होता", "जिंदगी में अगर तुम अकेले हो तो प्यार", "वफ़ा का दरिया कभी रुकता नही,"};
    String dosti[] = {"लोग रूप देखते है, हम दिल देखते है,", "करो कुछ ऐसा दोस्ती में", "इश्क़ और दोस्ती मेरी ज़िन्दगी के दो"};
    String majedar[] = {"आँखों से बरसात होती हैं","जिस हॉस्पिटल के हम डॉक्टर हैं,","तुम आये तो लगा हर खुशी आ गई"};
    String bhagavan[] = {"है ये सफर लंबा ही सही, मिलते रहे","शिव की ज्योति से प्रकाश बढ़ता है,","ज़िन्दगी हसीन है, ज़िन्दगी से प्यार करो"};
    String prerana[] = {"छू ले आसमान ज़मीन की तलाश ना","कली बेंच देगें चमन बेंच देगें,","कोन जाने कब मौत का पैगाम आ जाए,"};
    String jivan[] = {"वक्त बदल जाता है जिंदगी के साथ","अपनी तक़दीर में तो कुछ ऐसा ही","कोन किसका रकीब (enemy) होता"};
    String mohabbat[] = {"घर से बाहर कोलेज जाने के लिए वो","मोहबत को जो निभाते हैं उनको मेरा","वो रात दर्द और सितम की रात होगी,"};
    String yade[] = {"कोई खुशियों की चाह में रोया","मोहबत को जो निभाते हैं उनको मेरा ","छू ले आसमान ज़मीन की तलाश ना "};
    String other[] = {"उठा कर तलवार जब घोड़े पे सवार होते", "किसी को ये सोचकर साथ मत छोड़ना", "दिल पे क्या गुज़री वो अनजान क"};
    String rajaniti[] = {"वोटों के खातिर निकले हैं", "मिलते रहे हैं मंत्री ऐसे, देखो तो जरा ये,", "आज कल हर जगह वोटों के भिखारी" };
    String love[] = {"वो बेवफा हमारा इम्तेहा क्या लेगी.....","उस जैसा मोती पूरे समंद्र में नही है,", "जादू है उसकी हर एक बात मे,"};
    String sed[] = {"टूटे हुए प्याले में जाम नहीं आता","वो बेवफा हमारा इम्तेहा क्या लेगी....","मोहब्बत का नतीजा,"};
    String sarab[] = {"मे तोड़ लेता अगर तू गुलाब होती","रात गुमसूँ है मगर चेन खामोश नहीं,","आप को इस दिल में उतार लेने को जी"};
    String bevfa[] = {"कतरा कतरा आग बन के", "ना जाने क्यों", "हर किसी के नसीब में कहा लिखी होती"};
    String birthday[] = {"जन्मदिन के ये ख़ास लम्हें मुबारक,","तोहफा मैं तुझे आज मेरा दिल ही देता","आसमान की बुलंदियों पर नाम हो"};
    String holi[] = {"बाँहो मे भरकर पूछा था उन्होंने ....!!!.","नेचर का हर रंग आप पर बरसे", "सभी रंगों का रास है होली," };





    String shubhkamnaFull[] = {"ये इश्क भी एक अजीब एहसास होता है....,अल्ज़फों से ज्यादा निगाहोसे बया होता है...,हर पल बस उसके गम और खुशी की फ़िक्र होती है....,इसी एहसास से तो हमको जीने का गुमान होता है....","ज़िंदगी में अगर तुम अकेले हो तो प्यार करना सिख़लो, और प्यार कर लिया हैं तो इज़हार करने भी सिख़लो.ज़िंदगी में अगर तुम अकेले हो तो प्यार करना सिख़लो, और प्यार कर लिया हैं तो इज़हार करने भी सिख़लो...","वफ़ा का दरिया कभी रुकता नही, इश्क़ में प्रेमी कभी झुकता नही, खामोश हैं हम किसी के खुशी के लिए,ना सोचो के हमारा दिल दुःखता नहीं!"};
    String dostifull[] = {"लोग रूप देखते है,हम दिल देखते है, लोग सपने देखते है हम हक़ीकत देखते है,लोग दुनिया मे दोस्त देखते है, हम दोस्तो मे दुनिया देखते है.","करो कुछ ऐसा दोस्ती मेंकी 'थैंक्स एंड सॉरी' शब्दबे-ईमान लगेनिभाओ यारी ऐसे के 'यार को छोड़ना मुश्किल'और दुनिया छोड़ना आसान लगे....","इश्क़ और दोस्ती मेरी ज़िन्दगी के दोजहाँ है इश्क़ मेरा रूह तो दोस्ती मेरा इमां है इश्क़ पे कर दूँ फ़िदा अपनी ज़िन्दगी मगर दोस्ती पे तो मेरा इश्क़ भी कुर्बान है"};
    String majedarfull[] = {"आँखों से बरसात होती हैं जब आपकी याद साथ होती है, जब भी busy रहे मेरा cell तो समझ लेना आपकी होने वाली भाभी से मेरी बात होती हैं","जिस हॉस्पिटल के हम डॉक्टर हैं, हमारी पत्नी वहा की नर्स हैं क्या अजीब ज़ुल्म सहना पड़ता हैं अपनी ही बीवी को सिस्टर कहना पड़ता हें","तुम आये तो लगा हर खुशी आ गई यू लगा जैसे ज़िन्दगी आ गई था जिस घड़ी का मुझे कब से इंतज़ार अचानक वो मेरे करीब आ गई...."};
    String bhagavanfull[] = {"शिव की ज्योति से प्रकाश बढ़ता है, जो भी जाता है भोले के द्वार, कुछ ना कुछ उससे ज़रूर मिलता है!","ज़िन्दगी हसीन है, ज़िन्दगी से प्यार करो हो रात तो सुबह का इंतज़ार करो ...... वो पल भी आएगा, जिस पल का इंतज़ार हैं आपको..... बस रब पर भरोसा और वक़्त पे ऐतबार करो.....","अकाल मृत्यु वो मरे जो कार्य करे चांडाल का, कल भी उसका क्या करे जो भक्त हो महाकाल का"};
    String preranafull[] = {"आज़ाद हैं तोह आसमान छु ही आएंगे ज़िंदा है तो हर जंग जीत जायेंगे साथ हैं हम तो दुनिया को दिखा आएंगे तिरंगे के तीन रंगों में देश को समा जायेंगे","हर रिश्ते में विश्वास रहने दो; जुबान पर हर वक़्त मिठास रहने दो; यही तो अंदाज़ है जिंदगी जीने का; न खुद रहो उदास, न दूसरों को रहने दो..!","छू ले आसमान ज़मीन की तलाश ना कर, जी ले जिंदगी खुशी की तलाश ना कर, तकदीर बदल जाएगी खुद ही मेरे दोस्त, मुस्कुराना सीख ले वजह की तलाश ना कर."};
    String jivanfull[] = {"मौत एक सच्चाई है उसमे कोई ऐब नहीं क्या लेके जाओगे यारों कफ़न में कोई जेब नहीं एब ","वक्त बदल जाता है जिंदगी के साथ जिंदगी बदल जाती है वक्त के साथ वक्त नहीं बदलता दोस्तों के साथ बस दोस्त बदल जाते हैं वक्त के साथ...","अपनी तक़दीर में तो कुछ ऐसा ही सिलसिला लिखा है, किसी ने वक़्त गुजारने के लिए अपना बनाया, तो किसी ने अपना बना कर वक़्त गुज़ार लिया........"};
    String mohabbatfull[] = {"घर से बाहर कोलेज जाने के लिए वो नकाब मे निकली...... सारी गली उनके पीछे निकली.... इनकार करते थे वो हमारी मोहबत से. और हमारी ही तसवीर उनकी किताब से निकली.....","मोहबत को जो निभाते हैं उनको मेरा सलाम है, और जो बीच रास्ते में छोड़ जाते हैं उनको, हुमारा ये पेघाम हैं, वादा-ए-वफ़ा करो तो फिर खुद को फ़ना करो, वरना खुदा के लिए किसी की ज़िंदगी ना तबाह करो","वो रात दर्द और सितम की रात होगी, जिस रात रुखसत उनकी बारात होगी, उठ जाता हु मैं ये सोचकर नींद से अक्सर, के एक गैर की बाहों में मेरी सारी कायनात होगी......"};
    String yadefull[] = {"कोई खुशियों की चाह में रोया कोई दुखों की पनाह में रोया.. अजीब सिलसिला हैं ये ज़िंदगी का .. कोई भरोसे के लिए रोया.. कोई भरोसा कर के रोया..","तू चाँद मे सितारा होता आसमान के एक आशियाना में एक आशियाना हमारा होता लोग तुम्हे दूर से देखते नज़दीक से देखने का हक़ बस हमारा होता","तेरा दिल उदास क्यों है? तेरी आँखों में प्यास क्यों है? जो छोड़ गया तुझे मझदार में, उससे मिलने की आस क्यों है ? जो दे गया दर्द ज़िन्दगी भर का, वही तेरे लिए ख़ास क्यों है ??"};
    String otherfull[] = {"उठा कर तलवार जब घोड़े पे सवार होते बाँध के साफ़ा जब तैयार होते देखती है दुनिया छत पे चढ़के कहते है की काश हम भी ऐसे होशियार होते.....","किसी को ये सोचकर साथ मत छोड़ना की उसके पास कुछ नहीं तुम्हे देने के लिए बस ये सोचकर साथ निभाने की उसके पास कुछ नहीं है तुम्हारे सिवा खोने के लिए","जब आपका नाम ज़ुबान पर आता है, पता नही दिल क्यों मुस्कुराता है, तसल्ली होती है हमारे दिल को, कि चलो कोई तो है अपना, जो हर वक़्त याद आता है."};
    String rajanitifull[] = {"वो मौतों का खेल खेलते हैं बस राजनीति चमकाने को वो जनता को गोट समझते हैं अपनी वो क्या जाने जनता की पीढ़ा, शतरंज बिछाने को जो जनता को केवल मोहरा समझें, जो होते हैं पिटवाने को","कितने ही वादे करवालो, नेताओं का क्या , जाने वाला अभी जैसा चाहो उन्हें नचाओ, उनका क्या जाने वाला कुछ दिन और बचे हैं जितनी चाहो खुशी मनालो फिर तो रोना ही रोना है ईश्वर भी नहीं बचाने वाला","Boredom hits India! Elections are over! Modi busy with his work, Rahul Gandhi isn't giving any interviews, No AAP guy slapped, No IPL match, Aise thodi na chalta hai desh year!!!!"};
    String lovefull[] = {"वो बेवफा हमारा इम्तेहा क्या लेगी.... मिलेगी नज़रो से नज़रे तो अपनी नज़रे ज़ुका लेगी.... उसे मेरी कबर पर दीया मत जलाने देना..... वो नादान है यारो... अपना हाथ जला लेगी.","उस जैसा मोती पूरे समंद्र में नही है, वो चीज़ माँग रहा हूँ जो मुक़दर मे नही है, किस्मत का लिखा तो मिल जाएगा मेरे ख़ुदा, वो चीज़ अदा कर जो किस्मत में नही है....","घर से बाहर कोलेज जाने के लिए वो नकाब मे निकली..... सारी गली उनके पीछे निकली..... इनकार करते थे वो हमारी मोहबत से......... और हमारी ही तसवीर उनकी किताब से निकली........."};
    String sedfull[] = {"टूटे हुए प्याले में जाम नहीं आता इश्क़ में मरीज को आराम नहीं आता ये बेवफा दिल तोड़ने से पहले ये सोच तो लिया होता के टुटा हुआ दिल किसी के काम नहीं","वो बेवफा हमारा इम्तेहा क्या लेगी.... मिलेगी नज़रो से नज़रे तो अपनी नज़रे ज़ुका लेगी..... उसे मेरी कबर पर दीया मत जलाने देना..... वो नादान है यारो... अपना हाथ जला लेगी.","फूल सबनम में डूब जाते है, झख्म मरहम में डूब जाते है | जब आते है खत तेरे, हम तेरे गम में डूब जाते है."};
    String sarabfull[] = {"रात गुमसूँ है मगर चेन खामोश नही, कैसे कहदू आज फिर होश नही, ऐसा डूबा तेरी आखो की गहराई मैं, हाथ में जाम है मगर पीने का होश नही.","तेरा दिल उदास क्यों है? तेरी आँखों में प्यास क्यों है? जो छोड़ गया तुझे मझदार में उससे मिलने की आस क्यों है ? जो दे गया दर्द ज़िन्दगी भर का, वही तेरे लिए ख़ास क्यों है ??","पानी में विस्की मिलाओ तो नशा चड़ता है, पानी में रम मिलाओ तो नशा चड़ता है, पानी में ब्रेंड़ी मिलाओ तो नशा चड़ता है, साला पानी में ही कुछ गड़बड़ है...."};
    String bevfafull[] = {"हर किसी के नसीब में कहा लिखी होती हे चाहतें कुछ लोग दुनिया में आते हे सिर्फ तन्हाइयों के लिए","इस दुनिया मेँ अजनबी रहना ही ठीक है.... लोग बहुत तकलीफ देते है अक्सर अपना बना कर !!","उसकी दर्द भरी आँखों ने जिस जगह कहा था अलविदा आज भी वही खड़ा है दिल उसके आने के इंतज़ार में."};
    String birthdayfull[] = {"जन्मदिन के ये ख़ास लम्हें मुबारक,आँखों में बसे नए ख्वाब मुबारक, जिंदगी जो लेकर आई है आपके लिए आज.. वो तमाम खुशियों की हंसीं सौगात मुबारक!!!","तोहफा मैं तुझे आज मेरा दिल ही देता हूँ, ये हसीन मोका गवाना नहीं चाहता हूँ, अपने दिल की बात तुम्हारे सामने बतलाता हूँ, और तुम्हारे जन्म दिन की शुभ कामनाये देता हूँ.","दुआ मिले बन्दों से खुशियां मिले जग से, साथ मिले अपनों से रेहमत मिले रब से, ज़िन्दगी में आप को बे पनाह प्यार मिले, खुश रहे आप दुनिया में ज्यादा सुब से."};
    String holifull[] = {"बाँहो मे भरकर पूछा था उन्होंने ....!!! कौन सा रंग लगाँऊ तुमहे....!!! हमने भी कह दिया.....!! मुझे Sirf...!!! Tumhare होठो का रंग पसंद है..!!!","नेचर का हर रंग आप पर बरसे हर कोई आपसे होली खेलने को तरसे रंग दे आपको सब मिलकर इतना कि वह रंग उतरने को तरसे....","सभी रंगों का रास है होली, मन का उल्लास है होली, जीवन में खुशियाँ भर देती है, बस इसीलिए ख़ास है होली।"};


    String temp[];
    String temp1[];
    int position;


    @SuppressLint("MissingInflatedId")
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_list);
        listView = findViewById(R.id.otherlist);
        position = getIntent().getIntExtra("pos", 0);
        int img = getIntent().getIntExtra("img", 0);

        if(position==0)
        {
            temp=shubhkamna;
            temp1=shubhkamnaFull;
        }
        if(position==1)
        {
            temp=dosti;
            temp1=dostifull;
        }
        if(position==2)
        {
            temp=majedar;
            temp1=majedarfull;
        }
        if(position==3)
        {
            temp=bhagavan;
            temp1=bhagavanfull;
        }
        if(position==4)
        {
            temp=prerana;
            temp1=preranafull;
        }
        if(position==5)
        {
            temp=jivan;
            temp1=jivanfull;
        }
        if(position==6)
        {
            temp=mohabbat;
            temp1=mohabbatfull;
        }
        if(position==7)
        {
            temp=yade;
            temp1=yadefull;
        }
        if(position==8)
        {
            temp=other;
            temp1=otherfull;
        }
        if(position==9)
        {
            temp=rajaniti;
            temp1=rajanitifull;
        }
        if(position==10)
        {
            temp=love;
            temp1=lovefull;
        }
        if(position==11)
        {
            temp=sed;
            temp1=sedfull;
        }
        if(position==12)
        {
            temp=sarab;
            temp1=sarabfull;
        }
        if(position==13)
        {
            temp=bevfa;
            temp1=bevfafull;
        }
        if(position==14)
        {
            temp=birthday;
            temp1=birthdayfull;
        }
        if(position==15)
        {
            temp=holi;
            temp1=holifull;
        }


        adapter= new Category_List_Adapter(List_activity.this,temp,img,temp1);
        listView.setAdapter(adapter);


        listView.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> adapterView, View view, int position, long l) {


                Intent intent = new Intent(List_activity.this, Full_activity.class);
                intent.putExtra("pos", position);
                intent.putExtra("temp",temp);
                intent.putExtra("temp1",temp1);
                startActivity(intent);

            }
        });
    }
}